000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УслугиБанка/УслугиБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УслугиБанка</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МгновеннаяРассрочка</name>
      <description>Мгновенная рассрочка</description>
    </items>
  </predefined>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <comment>Услуга заблокирована</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <comment>Банковский идентификатор кредитования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСкидкиНаценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияБанка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПредоставления</name>
    <comment>Период, например, рассрочки платежа - в платежах (например 6 платежей)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>EnumRef.ТипыУслугБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>Эквайрер</name>
    <comment>Эквайрер по умолчанию</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураИсключения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураПредоставления</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыУслугБанка/ТипыУслугБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУслугБанка</name>
  <enumValues>
    <name>ОплатаЧастями</name>
  </enumValues>
  <enumValues>
    <name>МгновеннаяРассрочка</name>
  </enumValues>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
  <enumValues>
    <name>ПакетМалыша</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УслугиБанка/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере	//	LNK 27.05.2020 09:09:52
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

&НаКлиенте	//	LNK 30.07.2021 13:10:39
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "УслугаБанкаИзменение" Тогда

		Элементы.Список.Обновить();

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

&НаКлиенте	//	LNK 08.01.2020 11:32:03
Процедура КомандаСоздатьОплатаЧастями(Команда)

	НовыйЭлементУслугаБанка("ОплатаЧастями");

КонецПроцедуры

&НаКлиенте	//	LNK 08.01.2020 11:32:59
Процедура КомандаСоздатьКредит(Команда)

	НовыйЭлементУслугаБанка("Кредит");

КонецПроцедуры

&НаКлиенте	//	LNK 13.11.2020 06:22:19
Процедура КомандаСоздатьПакетМалыша(Команда)

	НовыйЭлементУслугаБанка("ПакетМалыша");

КонецПроцедуры

&НаКлиенте	//	LNK 08.01.2020 11:39:47
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если НЕ Копирование И НЕ Группа Тогда
		
		Отказ = Истина;
		НовыйЭлементУслугаБанка("ОплатаЧастями");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте	//	LNK 08.01.2020 11:41:00
Процедура НовыйЭлементУслугаБанка(ИмяПеречисления)

	СтруктураПараметры = Новый Структура("Основание", Новый Структура);
	СтруктураПараметры.Основание.Вставить("ТипУслуги", ПредопределенноеЗначение("Перечисление.ТипыУслугБанка." + ИмяПеречисления));

	ОткрытьФорму("Справочник.УслугиБанка.ФормаОбъекта", СтруктураПараметры, Элементы.Список);

КонецПроцедуры
